// Задача 25: Напишите цикл, который принимает на вход 
// два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

// Console.Write("Введите число A ");
// int A = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число B ");
// int B = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine($"A в степени B равно {Math.Pow(A,B)}");

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Задача 27: Напишите программу, которая принимает на 
// вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

// string Number = Console.ReadLine();
// // int count = Number.Length;
// int sum = 0;
// for (int i = 0; i < Number.Length; i++)
// {
//     sum = sum + Convert.ToInt32(Number[i].ToString());
// }
// Console.WriteLine($"Сумма цифр в числе: {sum}");

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//  Задача 29: Напишите программу, которая задаёт 
//  массив из 8 элементов и выводит их на экран.
//  1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19] 
//  6, 1, 33 -> [6, 1, 33]

// int [] array = new int[8];
// for (int i = 0; i < array.Length; i++)
// {
//     array[i] = new Random().Next(1, 101);
// }
// Console.WriteLine($"[{String.Join("; ",array)}]");



